-- phpMyAdmin SQL Dump
-- version 5.0.4
-- https://www.phpmyadmin.net/
--
-- Host: 127.0.0.1
-- Generation Time: Mar 26, 2021 at 04:35 PM
-- Server version: 10.4.17-MariaDB
-- PHP Version: 8.0.2

SET SQL_MODE = "NO_AUTO_VALUE_ON_ZERO";
START TRANSACTION;
SET time_zone = "+00:00";


/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!40101 SET NAMES utf8mb4 */;

--
-- Database: `a1`
--

-- --------------------------------------------------------

--
-- Table structure for table `article`
--

CREATE TABLE `article` (
  `id` int(20) NOT NULL,
  `name` varchar(500) NOT NULL,
  `head_img` varchar(100) NOT NULL,
  `descript` mediumtext NOT NULL,
  `status` tinyint(1) NOT NULL,
  `created` date NOT NULL,
  `view` int(10) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4;

--
-- Dumping data for table `article`
--

INSERT INTO `article` (`id`, `name`, `head_img`, `descript`, `status`, `created`, `view`) VALUES
(1, 'แนวเกม Among us', 'egs-amongus-innersloth-s1-2560x1440-675403774.jpg', 'อะมังอัส (อังกฤษ: Among Us) เป็นวิดีโอเกมหลายผู้เล่นที่พัฒนาและเผยแพร่โดยบริษัทอินเนอร์สลอธ เกมมีฉากในอวกาศและมีการสุ่มผู้เล่นให้มีโอกาสเป็นได้ทั้งลูกเรือ (Crewmates) หรืออิมพอสเตอร์ (Impostors, เอเลียนที่แฝงตัว) ที่กำหนดจำนวนได้ เป้าหมายของลูกเรือคือการทำภารกิจต่าง ๆ ให้สำเร็จ พร้อมทั้งหาตัวและกำจัดอิมพอสเตอร์ ส่วนอิมพอสเตอร์มีเป้าหมายในการปกปิดตัวตน ทำลายส่วนต่าง ๆ ในแผนที่ และฆ่าลูกเรือก่อนพวกเขาทำภารกิจสำเร็จ ภายในเกมมีการคัดผู้เล่นที่ต้องสงสัยออกผ่านทางการลงคะแนนเสียงข้างมาก โดยลูกเรือจะเป็นฝ่ายชนะเมื่ออิมพอสเตอร์ถูกกำจัดจนหมดหรือทำภารกิจได้ครบ ขณะที่อิมพอสเตอร์จะเป็นฝ่ายชนะหากส่วนที่ถูกทำลายไม่ได้รับการซ่อมแซม หรือจำนวนลูกเรือเหลือเท่ากับอิมพอสเตอร์ อะมังอัส เปิดตัวในปี 2018 ก่อนได้รับความนิยมในปี 2020 ทำให้อินเนอร์สลอธประกาศสร้าง อะมังอัส 2 ในเดือนสิงหาคม 2020 แต่ภายหลังได้ยกเลิกแล้วหันไปปรับปรุงเกมเดิมแทน', 0, '0000-00-00', 0),
(2, 'แนวเกม GTA (Grand Theft Auto)', 'aHR0cHM6Ly9zLmlzYW5vb2suY29tL2dhLzAvdWQvMjE1LzEwNzkzMTUvZ3RhLTcyOHg0MzcuanBn.jpg', 'แกรนด์เทฟต์ออโต (อังกฤษ: Grand Theft Auto หรือ GTA) คือชุดวิดีโอเกม พัฒนาโดยร็อกสตาร์ เกม และผลิตโดยร็อกสตาร์ นอร์ธ เปิดตัวครั้งแรกในปี พ.ศ. 2540 เกมชุดดังกล่าวประกอบด้วยเกมภาคหลัก 10 เกมและภาคเสริม 4 เกม เกมชุดแกรนด์เทฟต์ออโตเริ่มเป็นที่นิยมตั้งแต่เกมแกรนด์เทฟต์ออโต 3 (Grand Theft Auto III) เป็นต้นมา ทุกเกมล้วนเป็นเกมยอดนิยมและเป็นที่กล่าวขวัญ เกมชุดนี้ได้รางวัลมาหลายรางวัล และเกมในชุดนี้มักได้ตำแหน่งเกมแห่งปีจากหลายสถาบันนักวิจารณ์เกม และทำให้เกมนี้มีดาราฮอลลีวูดหลายคนเข้ามาร่วมให้เสียงในเกม เช่นซามูเอล แอล. แจ็กสัน, เบิร์ต เรย์โนลส์ เป็นต้น ทุกเกมในชุดนี้อนุญาตให้ผู้เล่นเล่นบทเป็นอาชญากรในเมืองใหญ่ โดยมีอิทธิพลเล็กน้อย หรือไม่มีเลยในช่วงแรก และผู้เล่นจะต้องใขว่คว้า และเสาะแสวงหาอิทธิพลผ่านองค์กรอาชญากรรมไปตลอดเกม ภารกิจหลายๆ ภารกิจในเกมมักตั้งอยู่ในสภาพแวดล้อมที่ทรุดโทรมและเป็นแหล่งอาชญากรรมในเมือง จุดมุ่งหมายก็มักจะเกี่ยวกับการก่ออาชญากรรม ซึ่งจำเป็นที่จะต้องทำให้สำเร็จเพื่อดำเนินเนื้อเรื่องในเกมต่อไป เช่นการปล้นธนาคาร, การลอบสังหาร และอาชญากรรมอื่น ๆ แต่ก็จะมีการขับรถแท็กซี่การขับรถพยาบาล การดับเพลิง การบริหารธุรกิจค้าประเวณี การแข่งรถ และการหัดขับเครื่องบิน เป็นภารกิจเสริมด้วย
เกมชุด GTA เป็นที่กล่าวถึงในด้านการที่อนุญาตให้ผู้เล่นมีเสรีภาพในการตัดสินใจว่าจะทำสิ่งใดก่อนสิ่งใดหลัง ซึ่งต่างจากเกมแนวแอ็คชั่นอื่นๆ ที่แต่ละภารกิจจะอยู่ในเฉพาะพื้นที่หนึ่งๆ ตามที่ผู้พัฒนาสร้างไว้เท่านั้น แต่ใน GTA ผู้เล่นสามารถเลือกภารกิจที่ผู้เล่นต้องการจะทำก่อนได้ และทางที่ผู้เล่นเลือกจะส่งผลต่อการเปลี่ยนแปลงไปของเนื้อเรื่องในเกม เมื่อเนื้อเรื่องดำเนินไปผู้เล่นจะพบกับอารมณ์ขัน มุขตลก เพลง และตัวช่วยลดความตึงเครียดในเกมต่างๆ ซึ่งเป็นจุดดึงดูดของเกมนี้ อีกทั้งเนื้อที่ที่กว้างใหญ่ในเกมซึ่งทำให้ผู้เล่นสามารถตระเวนไปทั่วในจุดไหนก็ได้ในเกม อาคารในเมืองที่สามารถปฏิสัมพันธ์ได้จำนวนมาก และภารกิจย่อยต่างๆ ตั้งแต่เกม GTA3 เนื้อเรื่องของมันกลายเป็นจุดเด่นอีกจุดหนึ่งของเกม พร้อมทั้งเสียงพากย์ของดาราหรือผู้พากย์ที่มีคุณภาพสูง และเสียงจากสถานีวิทยุซึ่งสามารถฟังผ่านทางพาหนะต่างๆ ได้ ทั้งหมดนี้เป็นการผสมผสานกันให้ได้สภาพแวดล้อมให้เหมือนส่วนทรุดโทรมของเมืองให้มากที่สุด และเป็นการล้อเลียนเมืองใหญ่ ๆ ในสหรัฐอเมริกาที่มีอยู่จริง', 0, '0000-00-00', 0),
(3, 'แนวเกม ROV (Arena of Valor)', '6196806354556f9baeeae2f3c4d96d0b.jpg', 'อารีนาออฟเวเลอร์ (อังกฤษ: Arena of Valor หรือชื่อเก่า เรียล์มออฟเวเลอร์; อังกฤษ: Realm of Valor) เป็นเกมแนวโมบาที่พัฒนาโดยทิมิสตูดิโอและจัดจำหน่ายโดยการีนา (สำหรับประเทศไทย) สำหรับแอนดรอยด์ การเล่นจะแบ่งออกเป็น 5 ตำแหน่ง | 5 ผู้เล่น โดยจะมีหน้ามีแตกต่างกันไปDark slayer lane จะเป็นเลนที่เหมาะกับการนำไฟเตอร์ไปใช้มากที่สุด เพราะทนรับดาเมจได้และมีดาเมจภายในตัวฮีโร่ที่แนะนำสำหรับการยืนเลนได้แก่ Riktor , Florentino , Omen , Yena เป็นต้น
Jungle จะเป็นตำแหน่งที่ทำดาเมจใส่แผงหลังของศัตรู หรือจะนำฮีโร่ประเภทแครี่มาอยู่ในตำแหน่งนี้ก็ได้ ฮีโร่ที่แนะนำสำหรับการนำมาฟาร์มจะแบ่งเป็น 2 ประเภทแอสซาซินได้แก่ Keera , Kriknak , Zill , Quillen แครี่ได้แก่ Eland’orr , Lindis , Fennik เป็นต้น
Middle lane จะเป็นเลนที่ต้องเดินเกมคู่กับโรมมิ่งบ่อยที่สุด โดยจะนำเอาเมจมาใช้ในเลนนี้ เพื่อสร้างดาเมจ เวทมนตร์ ให้เกิดสมดุลกับทีม และยังสามารถหยิบไฟตเตอร์และแครี่ ในกรณีที่ตำแหน่ง Jungle ในทีมเป็นเมจอยู่แล้วได้อีกด้วยฮีโร่ที่แนะนำสำหรับการยืนเลนได้แก่ เมจ Dirak , Raz , Paine , Krixi แครี่ Violet , The Joke ไฟเตอร์ Maloch , Veres เป็นต้น
Abyssal dragon lane จะเป็นการนำเอาแครี่มายืนเลนเพื่อจะใช้ประโยชน์ในช่วงเลทเกม โดยจะเป็นเลนที่ปลอดภัยที่สุดเพราะจะมีโรมมิ่งกับเมจคอยมาเลี้ยงตลอดเวลา โดยฮีโร่ที่แนะนำสำหรับการยืนเลนได้แก่ Capheny , Laville , Hayate , Elsu เป็นต้น
Roaming จะเป็นตำแหน่งที่รับดาเมจให้เพื่อนร่วมทีมและซัพพอร์ตเพื่อนเปิดแมพและโซนพื้นที่ให้เพื่อน โดยจะเดินเกมคู่กับเมจและป่า หรือเรียกว่า (สามทหารเสือ) โดยฮีโร่ที่แนะนำสำหรับการเดินเกมได้แก่ Zip , Teemee , Xeniel , Lumburr เป็นต้น', 0, '0000-00-00', 0);

--
-- Indexes for dumped tables
--

--
-- Indexes for table `article`
--
ALTER TABLE `article`
  ADD PRIMARY KEY (`id`);

--
-- AUTO_INCREMENT for dumped tables
--

--
-- AUTO_INCREMENT for table `article`
--
ALTER TABLE `article`
  MODIFY `id` int(20) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=4;
COMMIT;

/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
